app/controllers/admin/outlaw_cards_controller.rb

SELECT "outlaw_cards".* FROM "outlaw_cards" ORDER BY "outlaw_cards"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
    def index
      @pending_debt = pending_debt_count
      @recent_cards = OutlawCard.recent_first.limit(10)

INSERT INTO "outlaw_cards" ("description", "created_at", "redeemed_scan_id") VALUES (?, ?, ?) RETURNING "id"  [["description", "skipped homework"], ["created_at", "2026-05-17 17:45:01.166492"], ["redeemed_scan_id", nil]]
---
    def create
      unless valid_secure_token?(params[:secure_token])
        @message = "Token de segurança inválido."
        render "shared/error", status: :forbidden
        return
      end

      description = params[:description].to_s.strip
      description = nil if description.blank?

      OutlawCard.create!(description: description, created_at: Time.current.utc)